import React from "react";
import IntroLinks from "./IntroLinks";
import iqratrust from"../assets/IqraRauzatulAtfal.png"
function College() {
  return (
    <>
      <div className="intro-container">
        <header className="header">
          <h3 className="heading"><img src={iqratrust} alt="" className="iqratrust" /></h3>
        </header>
        <div className="intro-content">
          {/* <aside className="links-list">
            <IntroLinks />
          </aside> */}
          <div className="intro-detail">
            <h3>اقرأحفاظ کالج</h3>
            <br />
            <p>
              جب اقرأحفاظ سیکنڈری اسکول سے کافی تعداد میں طلبہ فارغ ہوئے تو
              والدین کی جانب سے خصوصا طالبات کے حوالہ سے یہ اصرار تھا کہ ہماری
              بچیوں نے تو آنکھ کھولتے ہی اقر آ ہی کو دیکھا ہے روضہ سے میٹرک تک
              کم و بیش ۱۲ سال کا عرصہ اقرأ میں گزارا ہے لہذا آپ اقرأکالج کی سطح
              پر بھی تعلیم کا آغاز کریں تا کہ ان کو حفظ قرآن کی حفاظت کے ساتھ
              ساتھ اقرأکا ماحول ملے۔ چنانچہ ۲۰۰۳ء میں اقرأحفاظ گرلز سائنس کالج
              کا آغاز کیا گیا، ابھی فی الحال یہ کالج صرف طالبات کے لیے شروع کیا
              گیا ہے اور اس میں گروپ بھی صرف سائنس رکھا گیا ہے البتہ سائنس میں
              (Pre-Medical) اور (Pre-Engineering) دونوں شعبے ہیں پہلے سال یعنی
              ۲۰۰۳ء میں اس کالج میں ۲۰ طالبات نے داخلہ لیا جواب ۲۰۰۵ ء میں انٹر
              سائنس کر چکی ہیں نتیجہ کی منتظر ہیں ) امید ہے کہ فرسٹ ائیر کی طرح
              انٹر میں بھی نمایاں نمبروں سے پاس ہوں گی جبکہ ۲۰۰۴ء میں بھی ۲۰
              طالبات نے اقرأ کالج میں داخلہ لیا اور اس سال ۲۰۰۵ء میں اب تک ۳۷
              طالبات داخلہ لے چکی ہیں جبکہ تادم تحریر داخلے جاری ہیں۔ اللہ
              تعالٰی سے دعا ہے کہ اللہ تعالٰی اقرأ روضۃ الاطفال کے تمام شعبوں کی
              انتظامیہ، اساتذہ، معلمات طلباء وطالبات اور دیگر عملہ سے اپنے دین
              کی خدمت لے لے اور قرآن کریم کے الفاظ ، معانی، احکام اور اس کے نظام
              کی حفاظت اور تنفیذ کی توفیق عطا فرمائے ، ہمارے اکابرین خصوصاً
              جنہوں نے اقراً کے لیے ہرممکن خدمات انجام دیں ان کو اپنے جوارِ رحمت
              میں جگہ نصیب فرمائے اور جنہوں نے اس کی خاطر اپنی جان بھی قربان کر
              دی اللہ تعالیٰ ان کے لہو سے ایسے چراغ روشن فرمادے کہ جن کی روشنی
              سے پوری دنیا منور ہو جائے ، اور ہمیں اس قرآن کے صدقے اپنے سایہ
              عاطفت میں لے لے اور ہمیں اس کام میں اخلاص نصیب فرمائے اور اس قرآن
              سے ہماری قبروں کو منور فرمادے اور اس کو ہمارے لیے صدقہ جاریہ و
              ذخیره آخرت بنادے۔ (آمین یا رب العالمین )
            </p>
          </div>
        </div>
      </div>
    </>
  );
}

export default College;
