import React from "react";
import "../pages/Foundertrustee.css";
import IntroLinks from "./IntroLinks";

const Foundertrustee = () => {
  return (
    <>
      <div className="intro-container">
        <header className="header">
          <h4 className="heading">
            اقرأ روضۃ الاطفال کے بانیان ،عہدیداران ٹرسٹیز
          </h4>
        </header>
        <div className="intro-content">
          <aside className="links-list">
            <IntroLinks />
          </aside>
          <div className="intro-detail">
            <h4 className="sub-heading">
              {" "}
              اقرأ روضۃ الاطفال کے بانیان ،عہدیداران ٹرسٹیز
            </h4>
            <section className="section-1">
              بانی و صدرِ اول:
              <br />
              شیخ الحدیث و مفتی اعظم پاکستان حضرت مفتی ولی حسن ٹونکی رحمتہ اللہ
              علیہ
              <br />
              صدر ِدوم:
              <br />
              حضرت اقدس مولانا محمد یوسف لدھیانوی شہید رحمتہ اللہ علیہ
              <br />
              صدرِ سوم :
              <br />
              حضرت سید انور حسین نفیس شاہ الحسینی رحمتہ اللہ علیہ
              <br />
              صدر ِچہارم :
              <br />
              شیخ الحدیث حضرت مولانا عبدالمجید لدھیانوی رحمتہ اللہ علیہ
              <br />
              صدرِ پنجم:
              <br />
              حضرت مولانا ڈاکٹر عبدالرزاق اسکندر رحمتہ اللہ علیہ
              <br />
              موجودہ صدر:
              <br />
              حضرت ڈاکٹرعبدالسلام خان صاحب دامت برکاتہم العالیہ
              <br />
              بانی و نائب مدیر:
              <br />
              حضرت مولانامفتی محمد جمیل خان شہیدرحمتہ اللہ علیہ
              <br />
              حضرت مولانامفتی مزمل حسین کاپڑیا صاحب رحمتہ اللہ علیہ
              <br />
              موجودہ سرپرست:
              <br />
              شیخ الاسلام حضرت مولانا مفتی محمد تقی عثمانی صاحب دامت برکاتہم
              العالیہ
              <br />
              بنیادی اراکین ٹرسٹ :
              <br />
              مفتی خالدمحمود ، مفتی محمد بن جمیل خان ، مفتی محمدثانی بن مفتی
              جمیل خان ، محترمہ زاہدہ مزمل حسین کاپڑیاؒ ،
              <br />
              جناب ڈاکٹر عبدالباری خان صاحب ،جناب محمد عبداللہ خالد ۔
              <br />
              اعزازی ٹرسٹی:
              <br />
              جناب محمد یونس بنگالی صاحب ، جناب میاں محمد احسن صاحب ، جناب حاجی
              محمد صدیق صاحب
              <br />
              تاریخ و مقام آغاز:
              <br />
              ۳ رجب المرجب۱۴۰۴ ھ بمطابق 4اپریل1984ء کراچی
              <br />
              افتتاح بدست و دعا:
              <br />
              عارف باللہ حضرت ڈاکٹر عبدالحئی صاحب عارفی نوراللہ مرقدہ
              <br />
              خلیفہ مجاز حکیم الامت حضرت مولانا اشرف علی صاحب تھانوی نوراللہ
              مرقدہ
              <br />
            </section>

            <section className="section-2">
              <h4> اقرأ روضۃ الاطفال کی صدارت:</h4>
             ء۱۹۸۴ءمیں امام اہل سنت حضرت مولانا مفتی احمد الرحمن ؒ اور مفتی
              اعظم پاکستان حضرت مفتی ولی حسن ٹونکیؒ کے حکم ا ور مشورے سے اقرأ
              روضۃ الاطفال کا آغاز ہوا، اقرأ روضۃ الاطفال کو شروع سے اکابر علماء
              اور مشائخ کی سرپرستی حاصل رہی ہے اور ہم یہ سمجھتے ہیں کہ اقرأ روضۃ
              الاطفال کی کامیابی ان علماء و مشائخ اور اکابر کی دعاؤں کی بدولت
              ہے، چنانچہ اقرأ روضۃ الاطفال کے افتتاح کے موقع پر مفتی اعظم
              پاکستان حضرت مفتی ولی حسن ٹونکیؒ، امام اہل سنت حضرت مفتی احمد
              الرحمن ؒ ، اُستاذ العلماء حضرت مولانا سلیم اللہ خان ، حضرت مولانا
              محمد ادریس میرٹھیؒ، حضرت مولانا سید مصباح اللہ شاہؒ، حضرت مولانا
              بدیع الزماںؒ، حضرت مولانا عبد القیوم چترالیؒ، حضرت مفتی نظام الدین
              شامزئیؒ، مولانا محمد شاہد تھانوی، مولانا خلیل الرحمن نعمانی، حافظ
              فضل الرحمن، حاجی محمد حسین کاپڑیا، حاجی عبد السمیع جیسے علماء شریک
              ہوئے، اور حکیم الامت حضرت مولانا اشرف علی تھانوی رحمۃ اللہ علیہ کے
              خلیفہ اجل عارف باللہ حضرت ڈاکٹر عبد الحئی عارفی رحمۃ اللہ علیہ
              جنہوں نے اس وقت کہیں آنا جانا موقوف کردیا تھا، حضرت مفتی محمد جمیل
              خان رحمۃ اللہ علیہ کی دعوت پر خصوصی طور پر اقرأ کی اس افتتاحی
              تقریب میں شرکت کی، مفتی ولی حسن ٹونکیؒ نے اس مختصر مگر پُر وقار
              تقریب سے خطاب فرمایا اور اقرأ کے اغراض و مقاصد پر روشنی ڈالتے ہوئے
              اقرأ کو پہلی اسلامی مونٹیسوری کا نام دیا۔ 
              <br/>
              <br/>
              مفتی محمد جمیل خان صاحبؒ
              نے اپنے دونوں ساتھیوں مفتی مزمل حسین کاپڑیا اور مفتی خالد محمود کو
              بٹھاکر یہ طے کیا کہ ہم تینوں نوجوان ہیں، کام بھی نیا ہے اور ہر قدم
              پر بھٹکنے کا خطرہ بھی ہے، اس لیے کسی بزرگ کو اقرأ کا بڑا بنائیں گے
              اور ہم تینوں کی حیثیت برابر ہوگی۔ یہ طے کرنے کے بعد مفتی اعظم
              پاکستان حضرت مفتی ولی حسن ٹونکی ؒ کو اقرأ کا صدر بنایا اور مفتی
              محمد جمیل خان صاحبؒ کی درخواست پر حضرت مفتی ولی حسنؒ نے تحریر بھی
              لکھ کر دی کہ: ’’میں اقرأ کی صدارت قبول کرتا ہوں اور ان تینوں
              برخورداروں کو وصیت کرتا ہوں کہ دلجمعی سے اخلاص و للہیت کے ساتھ کام
              کریں‘‘۔<br/>
              <br/> ۲؍ رمضان المبارک ۱۴۱۵ھ بمطابق ۲؍ فروری ۱۹۹۵ء میں مفتی ولی
              حسن ٹونکی رحمۃ اللہ علیہ انتقال فرماگئے، مفتی محمد جمیل خان شہیدؒ،
              حضرت مولانا محمد یوسف لدھیانوی شہیدؒ کے ساتھ اس وقت عمرے کی
              ادائیگی کے لیے حرمین کے سفر پر تھے، حضرت مولانا سعید احمد جلال
              پوری شہیدؒ بھی ہمراہ تھے، اسی سفر میں مدینہ منورہ میں مفتی محمد
              جمیل خان صاحبؒ نے حضرت اقدس حضرت مولانا محمد یوسف لدھیانوی رحمۃ
              اللہ علیہ کی خدمت میں اقرأ کا اہتمام قبول کرنے کی درخواست کی، آپؒ
              نے ازراہِ شفقت یہ درخواست قبول فرمالی، مفتی صاحبؒ نے مزید درخواست
              کی کہ اس کے لیے ایک تحریر دے دیں، آپ ؒ نے فرمایا: ‘‘پاکستان جاکر
              لکھ دوں گا۔ لیکن مفتی صاحبؒ نے کہا کہ : حضرت! یہاں مدینہ منورہ میں
              یہ تحریر لکھ دیں تاکہ مدینہ منورہ کی برکات بھی اس میں شامل
              
              ہوجائیں۔ تو حضرتؒ نے یہ تحریر لکھ کر دی:
              <br/>
              <br/>
              <span> الحمدللہ و سلام علی عبادہ الذین اصطفیٰ!</span>
              <br/>
              <br/>
              برادرم مولانا محمد جمیل خان کی فرمائش پر توکلاً علی اللہ’’اقرأ
              روضۃ الاطفال ٹرسٹ‘‘ کے صدر و مھتمم کی ذمہ داری قبول کرتا ہوں، حق
              تعالیٰ شانہٗ اس ادارے کو اپنی رضا کے مطابق قائم و دائم رکھے، اور
              اس کے تمام کارکنان کو اخلاص و رضا کی دولت سے سرفراز فرمائے اور
              جملہ معاونین کے لیے اس کو صدقہ جاریہ بنائے، آمین برحمتک یا رب
              العالمین!
              <spne>محمد یوسف عفی اللہ عنہ</spne>
              <span> ۱۸؍ رمضان المبارک ۱۴۱۵ھ</span>
              <span> ۱۷؍ فروری ۱۹۹۵ء</span>
              <br/><span>نزیل مدینہ منورہ زادہا اللہ شرفا و کرامۃً</span>
              <br/><span>ببرکۃ ساکنہا صلی اللہ علیہ و اٰلہٖ وسلم تسلیما</span>
              <br/> حضرت لدھیانویؒ کی شہادت کے بعد حضرت مفتی
              محمد جمیل خانؒ، حضرت مولانا خواجہ خان محمدصاحب امیر مرکزیہ کا
              پیغام لے کر پیر طریقت حضرتِ اقدس حضرت سید نفیس شاہ الحسینی رحمۃ
              اللہ علیہ کی خدمت میں حاضر ہوئے اور حضرتؒ کا پیغام دیا کہ آپ عالمی
              مجلس تحفظ ختم نبوت کی نائب امارت قبول فرمائیں تو ساتھ ہی یہ
              درخواست بھی پیش کی کہ آپ اقرأ کی صدارت قبول فرماتے ہوئے ہماری اور
              ہمارے ادارے کی سرپرستی فرمائیں ، تو حضرت نے بہت ہی شفقت کا اظہار
              فرماتے ہوئے اس درخواست کو شرفِ قبول بخشا اور یہ تحریر لکھ کر عنایت
              فرمائی:<br/>
              <br/> ’’بندۂ ناچیز توکلاً علی اللہ اقرأ روضۃ الاطفال کا اہتمام
              قبول کرتا ہے۔‘‘
              <br/>
              
               نفیس الحسینی
                ۲۳؍ صفر المظفر ۱۴۲۱ھ<br/>
                <br/>



                <br/>
              <br/>
                حضرت شاہ صاحب
              رحمۃ اللہ علیہ کے انتقال کے بعد امام اہل سنت حضرت مولانا محمد
              سرفراز خان صفدر اور حضرت مولانا خواجہ خان محمد رحمۃ اللہ علیہما
              اور حضرت مولانا ڈاکٹر عبد الرزاق اسکندر رحمۃ اللہ علیہ کی خدمت میں
              باقاعدہ درخواست کی گئی کہ وہ اقرأ کی سرپرستی فرمائیں، اول الذکر
              دونوں بزرگوں سے فون پر درخواست کی گئی تھی، چونکہ پہلے بھی یہ بزرگ
              اقرأ کی سرپرستی فرمایا کرتے تھے اس لیے فون پر بھی ہماری درخواست کو
              سن کر فرمایا: دل و جان سے اقرأ کے لیے دعا کرتے ہیں، اور حضرت ڈاکٹر
              صاحب نے ہماری تحریری درخواست پر یہ الفاظ تحریر فرمائے:<br/>
              <br/> ’’باسمہٖ
              تعالی<br/>
               <span>میں اس مبارک علمی ادارے اور اس کے مسؤلین کے لیے ہمیشہ سے دعا
               گو رہا ہوں، 
               <br/></span> اور ان شاء اللہ آئندہ بھی دعا گو رہوں گا۔‘‘ عبد الرزاق
              اسکندر ۱۶،ربیع الاول، ۱۴۲۹ ۲۵،مارچ، ۲۰۰۸ ان حضرات کو باقاعدہ
              سرپرست بنانے کے علاوہ حضرت اقدس حضرت مولانا عبد المجید لدھیانوی ؒ
              شیخ الحدیث جامعہ باب العلوم کہروڑ پکا کی خدمت میں صدارت قبول کرنے
              کی درخواست پیش کی گئی ، آپ نے بھی دیگر اکابر کی طرح شفقت کا معاملہ
              فرمایا اور اقرأ کی صدارت قبول کرتے ہوئے یہ تحریر لکھ کر دی: ’’اقرأ
              روضۃ الاطفال کی جانب سے اس سلسلۃ الذہب میں شمولیت کی دعوت موصول
              ہوئی، میں تو ابتدا ہی سے اس تنظیم سے محبت و عقیدت رکھتا ہوں اور اس
              تنظیم کے کارکنان کے لیے دعا گو ہوں، اس دعوت کو اپنے لیے سعادت
              سمجھتے ہوئے قبول کرتا ہوں، اللہ تعالیٰ قبولیت سے نوازے اور میرے
              لیے ذریعہ آخرت بنائے۔ عبد المجید غفرلہٗ ۱۸؍ ربیع الاول ۱۴۲۹ھ
              ۲۷؍مارچ ۲۰۰۸، یوم الخمیس‘‘ خواجہ خواجگان شیخ المشائخ حضرت مولانا
              خواجہ خان محمد رحمۃ اللہ علیہ کے انتقال کے بعد شیخ الاسلام حضرت
              مولانا مفتی محمد تقی عثمانی مدظلہ العالی سے درخواست کی تو آپ نے
              بھی فرمایا کہ میں پہلے بھی سرپرستی کرتا تھا، اب بھی کرتا ہوں۔ یکم
              فروری 2015ء کو حضرت مولانا عبد المجید رحمۃ اللہ علیہ کا انتقال ہوا
              تو ان کے انتقال کے بعد حضرت ڈاکٹر عبد الرزاق اسکندرؒ کی خدمت میں
              اقرأ کی صدارت قبول کرنے کی درخواست کی گئی جو آپ نے ازراہ شفقت قبول
              فرمائی۔ 30؍جون 2021ء مطابق ۱۹؍ ذیقعدہ ۱۴۴۲ھ بروزبدھ حضرت ڈاکٹر
              صاحبؒ کا وصال ہوا۔ حضرت ڈاکٹر صاحب کے انتقال کے بعد حضرت مولانا
              احمد علی لاہوری کے سلسلہ کے ایک بزرگ حضرت مولانا خلیفہ غلام رسول ؒ
              کے خلیفہ ، پیر طریقت حضرت ڈاکٹر عبد السلام مدظلہٗ کی خدمت میں اقرأ
              کی صدارت قبول کرنے کی درخواست کی گئی آپ نے اس درخواست کو قبول
              فرماتے ہوئے درج ذیل تحریرلکھ کر دی۔ ’’ قرآن پاک اللہ رب العزت کا
              کلام ہے ۔اللہ کے کلام کی خدمت سے کون انکار کرسکتا ہے ۔خادم اور
              دعاگو بن کر اس کی ذمہ داری کو قبول کرتا ہوں۔‘‘ عبدالسلام بن
              عبدالغفار ۲۷؍ محرم الحرام ۱۴۴۳ھ ۵؍ستمبر۲۰۲۱ شیخ الاسلام حضرت
              مولانا مفتی محمد تقی عثمانی مدظلہٗ ، حضرت مولانا خواجہ خلیل احمد
              مدظلہ کی خدمت میں درخواست پیش کی تو حضرت نے اس درخواست کو شرفِ
              قبول عطا فرماتے ہوئے بالترتیب یہ تحریر لکھ کردی۔ بسم اللہ الرحمن
              الرحیم الحمدللہ و سلام علی عبادہ الذین اصطفیٰ! تاریخ: ۱۴۴۳/۰۴/۱۲ھ
              18/11/2021 برادر عزیز و مکرم جناب مولانا خالد محمود صاحب و جناب
              مولانا اعجاز مصطفی صاحب زید مجدکم السامی السلام علیکم و رحمۃ اللہ
              و برکاتہ آپ کا گرامی نامہ آپ ہی کے ذریعے موصول ہوا۔ آپ نے بندہ کی
              ملتان کی ختم نبوت کانفرنس میں کی گئی تقریر کی اشاعت کی اجازت طلب
              کی ہے۔ میں کیا اور میری تقریر کیا؟ لیکن اگر آپ مناسب اور مفید خیال
              فرمائیں تو بندے کے لیے سعادت ہوگی۔ دوسرے آپ نے مجھ ناکارہ کو اقرأ
              روضۃ الاطفال کے سرپرستان کی فہرست میں شامل کرنے کی فرمائش کی ہے۔
              الحمدللہ بندہ اس ادارے کی عظیم خدمات سے واقف بھی ہے اور معترف بھی۔
              یہ میرے استاذ گرامی حضرت مولانا مفتی ولی حسن صاحب قدس سرہ کا لگایا
              ہوا گلشن ہے۔ بندہ اپنی نا اہلی کے باوجود اس ادارے کی کسی بھی ممکن
              خدمت کو اپنے لیے شرف سمجھتا ہے۔ سرپرست تو بڑی چیز ہے، اس کی خدمات
              میں بھی بندے کا نام لگ جائے تو عزت افزائی ہے۔ جزاکم اللہ خیرا بندہ
              محمد تقی عثمانی عفی عنہ پیر طریقت عالمی مجلس تحفظ ختم نبوت
              کےامیرمرکزیہ خانقاہ سراجیہ کندیاں شریف کے سجادہ نشین حضرت خواجہ
              خلیل احمد مدظلہ کی خدمت میں سرپرستی قبول کرنے کی درخواست پیش کی
              گئی تو حضرت نے لکھا! بسم اللہ الرحمن الرحیم بعد الحمد والصلوٰۃ و
              ارسال التسلیمات و التحیات فقیر ابو السعد خلیل احمد عفی عنہ حضرت
              مولانا مفتی خالد محمود صاحب نائب مدیر اقرأ روضۃ الاطفال ٹرسٹ
              آنجناب کا گرامی نامہ موصول ہوا جس میں اکابر رحمہم اللہ کے لگائے
              ہوئے شجرہ طیبہ کی آبیاری اور خدمت کے لیے فقیر کا نام بھی تجویز کیا
              گیا ہے۔ فقیر توکلاً علی اللہ اس خدمت کو سعادت سمجھتے ہوئے قبول
              کرتا ہے اور دعا گو ہے کہ مولائے کریم اس انجمن اور اس میں کام
              کرنیوالے تمام احباب کو ترقیات نصیب فرمائے، معاونت فرمائے، سرور اور
              فتن سے حفاظت فرما کر دارین کی سعادتیں نصیب فرمائے۔ آمین والسلام
              فقیر ابو السعد خلیل احمد عفی عنہ خانقاہ سراجیہ نقشبندیہ مجددیہ
              کندیاں ، ضلع میانوالی
            </section>
          </div>
        </div>
      </div>
    </>
  );
};

export default Foundertrustee;
