import React from "react";
import IntroLinks from "./IntroLinks";
import iqratrust from"../assets/IqraRauzatulAtfal.png"
const Hifz = () => {
  return (
    <>
      <div className="intro-container">
        <header className="header">
          <h3 className="heading"><img src={iqratrust} alt="" className="iqratrust" /></h3>
        </header>
        <div className="intro-content">
          {/* <aside className="links-list">
            <IntroLinks />
          </aside> */}
          <div className="intro-detail">
            <h3>شعبۂ حفظ قرآن کریم</h3>
            <br />
            <p>
              قرآن کریم میں اللہ تبارک و تعالیٰ کا ارشاد ہے:<br/> وَلَقَدْ يَسَّرْنَا
              الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُّدَّكِرٍ ( سورة القمر ) <br/>ترجمہ:
              اور ہم نے اس قرآن کو آسان کر دیا نصیحت حاصل کرنے کے لیے، تو کیا
              کوئی ہے نصیحت حاصل کرنے والا ؟“ <br/>
              <br/>
              اس آیت مبارکہ میں اللہ تبارک و
              تعالیٰ کا ارشاد ہے کہ قرآن کریم سمجھنے کے لیے نہایت آسانی ہے۔ اس
              میں شک نہیں لیکن اس آسانی میں فہم اور نصیحت حاصل کرنے کے ساتھ حفظ
              قرآن بھی شامل ہے، قرآن کریم کا حفظ بھی اللہ نے اس اعتبار سے آسان
              بنادیا کہ آپ دنیا کی کوئی اور کتاب اس طرح حفظ نہیں کر سکتے جس طرح
              قرآن کریم حفظ کیا جاتا ہے اسی طرح اللہ تبارک و تعالیٰ کا ارشاد ہے:
              إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ
              (سورة الحجر ) <br/>ترجمہ: بے شک ہم نے قرآن کو نازل کیا اور ہم ہی اس کی
              حفاظت کرنے والے ہیں۔“ <br/>
              <br/>اس آیت میں جس حفاظت قرآن کا ذکر ہے اس سے
              مراد قرآن کی کامل و اکمل حفاظت ہے یعنی الفاظ قرآن کی حفاظت، قرآن
              کریم کے مفہوم و معانی کی حفاظت، قرآن کریم کے احکام ومسائل کی
              حفاظت، قرآن کریم کے اسلوب دعوت وتبلیغ کی حفاظت وغیرہ وغیرہ۔
              <br/>
              <br/>
              مسلمانوں کا حفظ قرآن کے ساتھ جو تعلق رہا ہے اور اسی جذبہ کے زیر
              اثر بچپن میں قرآن یاد کرانے کا جو شوق مسلمانوں کے ہر طبقہ میں پایا
              جاتا ہے وہ اس قدر روز روشن کی طرح واضح ہے کہ اس کے لیے کسی تاریخی
              شہادت کی حاجت نہیں، شاید ہی مسلمانوں کی کوئی معقول آبادی ہوگی جس
              میں آپ کو ایک یا دو آدمی پورے قرآن کے حافظ نہ مل جائیں ، امیر و
              غریب اور متوسط ہر طبقہ میں حفاظ قرآن ہوتے تھے۔
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default Hifz;
