import React from "react";
import './Introduction.css'
import IntroLinks from './IntroLinks'
import { Outlet } from "react-router-dom";

const Introduction = () => {
  return (
    <>
      <div className="intro-container">
        <header className="header">
        <h3 className="heading">اقرأروضۃالاطفال</h3>
       </header>
       <div className="intro-content">
       <aside className="links-list"> 
          <IntroLinks/>
       </aside>
        <div className="intro-detail">
        <h4>اقرأ روضۃ الاطفال</h4>
        <p>
          قوموں کے عروج و زوال اور ان کے بننے بگڑنے میں تعلیم سب سے موثر ذریعہ
          ہے، خصوصاً چھوٹے اور معصوم بچوں کی تعلیم اگر ابتدا ہی سے بہتر انداز سے
          ہو اور انہیں ایسی بنیادی تعلیم دی جائے جومستقبل میں ان کی زندگی پر
          اچھے اثرات مرتب کرے اور انہیں ایک اچھا مسلمان اور باشعور شہری بنائے تو
          آج کے یہ بچے کل کے بہترین معمار ثابت ہوں گے، بصورت دیگر یہ بچے کل بڑے
          ہوکر قوم کی تعمیر و ترقی میں کوئی کردار ادا کرنے کے بجائے قوم و ملت کی
          رسوائی کا باعث ہوں گے ۔ اسلام نے بھی تعلیم کو سب سے زیادہ اہمیت دی اور
          اللہ تعالیٰ نے وحی کا آغاز ہی لفظ اقرأ سے فرمایا ،تاکہ اسلام قبول
          کرنے والے کا ذہن سب سے پہلے تعلیم کی طرف متوجہ ہو۔پھر نبی اکرم صلی
          اللہ علیہ وسلم کی ایک خصوصیت یہ بھی ہے کہ آپ صلی اللہ علیہ وسلم خاتم
          النبیین ہیں اور قیامت تک آپ ہی کی تعلیمات اُمت کے لیے ہدایت کا سبب
          رہیںگی، اس لیے آپ صلی اللہ علیہ وسلم نے ایک ایسی جماعت تیار فرمائی جس
          نے آپ صلی اللہ علیہ وسلم کی وفات کے بعد اس نظام کو دنیا میں رائج کیا
          اور ایک وقت ایسا آیا کہ دنیا کا ہر خطہ اس نظام کی برکت سے منور ہوگیا
          اور ہر شخص اس کی حقانیت کا قائل ہوگیا، وہ جماعت صحابہ کرام رضوان اللہ
          علیہم اجمعین کی جماعت تھی۔ امت مسلمہ نے جب تک نبی اکرم صلی اللہ علیہ
          وسلم کی ہدایات کو پیش نظر رکھا اور اپنے بچوں کی تعلیم کا اسلام کے
          مطابق بندوبست کیا، مسلمان قوم ترقی کی راہ پر گامزن رہی اور جب امت
          مسلمہ نے عیش و عشرت کو اپنا کر اس فریضہ سے غفلت برتی ، قوم اسلامی
          تعلیمات سے دور ہوکر غیر مسلموں کے نظریات اپنا بیٹھی، تو ذلت ان کا مقدر
          ہوگئی۔ اس لیے دشمنانِ اسلام کی ہمیشہ یہی کوشش رہی کہ مسلمانوں کے نظام
          تعلیم پر حملہ کیا جائے۔ قیام پاکستان کے بعد خیال تھا کہ نئی نسل کی ذہن
          سازی اور اسلامی تربیت کے لیے نظام تعلیم کو اسلامی قالب میں ڈھالاجائے
          گا، لیکن .. . اے بسا آرزو کہ خاک شدہ پاکستان میں سابقہ نظام تعلیم ہی
          جاری رہا اور اس نظام کے تعلیم یافتہ حضرات عصری علوم میںنام نہاد مہارت
          کے زعم میں اسلام سے دور ہوتے چلے گئے اور اب حالت یہ ہوگئی کہ اسلام کے
          متفقہ اُصولوں سے انحراف ہونے لگا، قرآن اور اس کی تعلیمات کو پڑھنا عیب
          سمجھا جانے لگا۔یورپ کی طرف سے اس سلسلے میں ایک اور بھر پور وار ہوا اور
          بچوں کو ان کی سب سے پہلی درسگاہ ماں کی گود سے نکال کر غیروں کے ماحول
          میں دے دیا گیا (حالانکہ اسلامی تعلیمات کے مطابق بچہ کی سب سے پہلی ذہن
          سازی ماں کرتی ہے، اسی لیے ماں کو حکم دیا گیا کہ وہ ابتدا ہی سے بچے کو
          اسلامی ماحول مہیا کرے) اور نرسری ،مونٹیسوری، کنڈر گارٹن کے نام سے
          چھوٹے چھوٹے پرائیویٹ ادارے کھول دئیے گئے جس میں دو ڈھائی سال کے بچوں
          کو کھیل کود کے ذریعے تعلیم کے نام پر انگریزی ماحول میں ڈھالنے کی کوشش
          کی جانے لگی۔ افسوس تو یہ ہے کہ اس تمام طریقہ کار میں مسلمان بجائے اس
          کے کہ اپنے اسلامی اصول اپناتے، انہوں نے غیر مسلموں کے طریقہ کار کو
          اپنایا اور یوں ابتدا ہی سے بچوں کی تربیت دین بیزار ماحول میں ہونے
          لگی۔یہ وبا اتنی پھیلی کہ دین دار گھرانے بلکہ بعض علماء کرام کے گھرانے
          بھی اس سے محفوظ نہ رہ سکے اور مائیں اپنی مشکلات اور پریشانی دور کرنے
          کے لیے اپنے ہی ہاتھوں سے اپنے بچوں کو بیگانہ کرنے لگیں۔ بد قسمتی سے
          علماء کرام کی طرف سے ایسے بچوں کی تعلیم کے لیے کوئی انتظام نہ تھا اور
          اس وار کے بھر پور دفاع کے لیے ان کی طرف سے کوئی مؤثر کارروائی نہ
          ہوسکی۔ بعض لوگوں کے ذہن میں یہ خیال آیا بھی لیکن وہ ناکامی کے خوف سے
          میدانِ عمل میں نہ اُترے اور یہ میدان دشمن کے لیے خالی رہ گیا ،جس سے اس
          نے بھر پور فائدہ اٹھایا۔ ان اداروں کی رفتار ترقی اور امت مسلمہ کی
          خوابیدگی دیکھ کر احساس ہونے لگا کہ اگر صورتحال اسی طرح رہی تو کچھ ہی
          عرصے میں نئی نسل کے ذہن سے اسلام اور اس کی تعلیمات یکسر مٹ جائیں گی
          اور لوگ قرآن و حدیث کا نام تک بھول جائیں گے۔ ان حالات میں بہت سے اہل
          درد بے چین تھے ،بہت سے بزرگ پریشان تھے کہ تدارک کی کیا صورت ہوگی
          ؟خوداقرأ کے بانیان کرام اپنے خاندان اور ماحول کو دیکھ کر حیران
          وپریشان تھے کہ ان معصوم بچوں کی تعلیم و تربیت کے لئے کیا کیا جائے ؟آخر
          اس شب وروز کی کڑھن ،آہ نیم شب اور دعاء سحر گاہی پر اللہ کو ترس ا ہی
          گیا۔پاکستان اور عالم اسلام کے جید علماء کرام اور مشائخ عظام کے قلوب کو
          اللہ تعالیٰ نے اس فکر کی جانب متوجہ کردیا اور سب ایک ہی رخ پر سوچنے
          لگے۔مفتی محمد جمیل خان ،مفتی خالد محمود اور مفتی مزمل حسین نے اپنے درد
          اور فکر مندی کو یکساں پایا تو طویل مشوروں کے بعد چھوٹے بچوںاور بچیوں
          کے لئے ایک جدید تعلیمی ادارے کا قیام ہی حل تجویز ہوا ۔مفتی محمد جمیل
          خان اپنے دونوں رفقاء سے عمر میں بھی بڑے تھے اور تعلیم و تجربہ کے
          اعتبار سے بھی ان سے سینئیر تھے لہذا انہوں نے اپنے رفقاء کو حوصلہ دیا
          اور تینوں حضرات نے اپنے استاذمحترم شخ الحدیث حضرت مفتی ولی حسن ٹونکی
          کی خدمت میںحاضر ہوکر اپنے خیالات اور آئندہ کے ارادے پیش کرتے ہوئے
          رہنمائی کی درخواست کی ۔حضرت مفتی ولی حسن صاحب کے قلب وذہن میں بھی اسی
          طرح کے خیالات و خدشات نے ڈیرے ڈال رکھے تھے ،لہذا حضرت نے فوری طور پر
          اپنے شاگردوں کے ارادوں کی تصویب فرماتے ہوئے ان کی حوصلہ افزائی فرمائی
          کہ چھوٹے بچوں کو محفوظ دینی ماحول دینے کے لئے ایسے ادارے کا قیام وقت
          کی اہم ترین ضرورت ہے ،جہاں موجودہ ماحول کو مد نظر رکھتے ہوئے مناسب
          سہولیات بھی ہوں اور عزم و ہمت سے لیس بہترین اساتذہ و معلمات بھی ۔ حضرت
          مفتی صاحب نے اپنے بھرپور تعاون کا بھی یقین دلایا ،جبکہ ہونہار شاگردوں
          نے اس سے بڑھ کر سرپرستی کی درخواست کی اور آخر کاراقرأ روضة الاطفال کا
          قیام عمل میں آیا جس کے اولین صدر کی حیثیت سے حضرت مفتی ولی حسن ٹونکی
          نے ذمہ داری سنبھال لی ۔ حضرت مفتی صاحب کی صدارت و ادارت میںاقرأ کا
          قیام کا اعلان ہوا تو مرجھائے ہوئے چہرے اور بجھے ہوئے دل کھل اٹھے ، باد
          نسیم کی طرح سکون بخش کیفیت محسوس ہونے لگی اور اہل اللہ اور علماء کرام
          کی جانب سے دعائوں کے تحفے موصول ہونے لگے۔یہ انہی اہل اللہ کے اخلاص اور
          ان کی دعائوں کا ثمرہ ہے کہ جلد ہی اقرأ میں تعلیمی سلسلہ شروع ہوگیا ۔
        </p>
        <h4>اقرأ روضۃ الاطفال کا آغاز:</h4>
        <p>
          مفتی مزمل حسین صاحب کے والد حاجی محمد حسین کاپڑیا کے تعاون سے حضرت
          مولانا سید زوار حسین شاہ رحمة اللہ علیہ کے مکان کے دو کمروں میں ٤
          اپریل ١٩٨٤ء کو اقرأ روضة الاطفال کا آغاز ہوا۔ اقرأ روضة الاطفال کی
          افتتاحی تقریب میں دعا کے لیے مفتی صاحب نے حضرت ڈاکٹر عبد الحئی عارفی
          رحمة اللہ علیہ سے وقت لیا، آپ نے اسے قبول فرماتے ہوئے ارشاد فرمایا کہ:
          مجھے گھر سے لے لینا، مفتی صاحب جب حضرت ڈاکٹر عبد الحئی عارفی کی خدمت
          میں حاضر ہوئے تو گاڑی میں بیٹھنے کے بعد حضرت ڈاکٹر صاحب فرمانے لگے:
          ''میں آج کل کہیں جاتا نہیں ہوں، اگر کوئی آئے تو یہیں بیٹھے بیٹھے دعا
          کردیتا ہوں، تم سے نجانے کیوں میں نے وعدہ کرلیا؟'' عند اللہ یہ اقرأ کی
          مقبولیت کی علامت تھی کہ اللہ تعالیٰ نے اپنے نیک اور خاص بندوں کے قلوب
          اس طرف متوجہ کردئیے تھے۔ اقرأ کی افتتاحی تقریب میں حضرت ڈاکٹر صاحب کے
          علاوہ مفتی اعظم پاکستان مفتی ولی حسن ٹونکی ، مفتی احمد الرحمن ، مولانا
          محمد ادریس میرٹھی، مولانا سید مصباح اللہ شاہ ، مولانا بدیع الزماں،
          مولانا عبد القیوم چترالی، مولانا محمد سواتی، مفتی نظام الدین شامزئی،
          مولانا سلیم اللہ خان، مولاناشاہد تھانوی، حضڑت مولانا سید زوار حسین شاہ
          کے صاحبزادے حافظ فضل الرحمن ، ڈاکٹر عبد الرحیم اسماعیل گاندھی، حاجی
          محمد حسین کاپڑیا، مولانا عبد المجید، مولانا خلیل الرحمن نعمانی اور
          کراچی کے جید علماء کرام و مشائخ عظام شریک ہوئے۔ حضرت ڈاکٹر عبد الحئی
          عارفی رحمة اللہ علیہ نے بچوں کو بسم اللہ پڑھا کر اپنی دعائوں سے اس کا
          افتتاح فرمایا، مفتی اعظم پاکستان مفتی ولی حسن ٹونکی نے خطاب کرتے ہوئے
          اقرأ کو پاکستان میں پہلی اسلامی مونٹیسوری قرار دیا۔
        </p>
        <h4>اقرأ ایک مقدس مشن:</h4>
        <p>
          
          اقرأ روضۃ الاطفال ایک عظیم تحریک، ایک مقدس مشن اور ایک مبارک لائحہ عمل
          ہے۔ اس عظیم تحریک اور مقدس مشن کا اہم ترین مقصد قرآن پاک کی تعلیم کے
          ذریعہ مسلمانوں کی عزت و عظمت کا حصول، مسلمانوں کے گھروں سے نکلے ہوئے
          قرآن مجید کی دوبارہ واپسی، قرآن مجید کی تعلیم سے بے زاری کو دور کرنا
          اور مسلمانوں کو قرآن کی تعلیم کی طرف رغبت دلانا ہے۔ رب کائنات کا
          کروڑہا احسان و فضل ہے کہ شیخ طریقت حضرت مولانا سید زوار حسین نور اللہ
          مرقدہ کے عطا کردہ دو کمروں میں ١٨ بچوں سے شروع ہونے والی یہ تحریک آج
          پاکستان کی اشاعتِ قرآن اور حفظِ قرآن کی شناخت کی تحریک بن گئی ہے اور
          پاکستان بھر میں اقرأکی طرف رجوع عام ہوا ہے ۔ اقرأ کے نام کی بلندی،
          کامیابی اور شناخت کسی فرد یا ادارہ کی کامیابی نہیں ۔ یہ کامیابی ہے
          کتاب اللہ کی، علوم نبوی صلی اللہ علیہ وسلم کی، علماء امت کی ، حافظ
          بچوں کے والدین کی، دینی تعلیم کی زبوں حالی پر کڑھنے والے اہل دل کی ۔
          اے اللہ! ان سب کی مساعی جمیلہ کو شرفِ قبولیت عطا فرما۔ اقرأ روضۃ
          الاطفال کا قرآنی مشن افراد یا ادارے سے وابستہ نہیں اور نہ ہی اس کا
          مقصد مال و دولت ، عزت و شہرت یا دنیوی شرف و جاہ کا حصول ہے ،بلکہ مسلم
          معاشرے کو تعلیم قرآن کی بنیاد پر تعلیم کا ایک ایسا اسلوب و طرز مہیا
          کرنا ہے کو ہر مسلمان کو اس کی متاع گم گشتہ یاد دلادے ،ہر دل میں اس کے
          حصول کی تڑپ پیدا کردے اور ہر بچے کو دین و دنیا کے علوم اور بہترین
          تربیت سے آراستہ کر کے کامیابی کی شاہراہوں پر ڈال دے ۔
          <br/>
          نغمہ کجاو من کجا
           ساز ِسخن بہانہ ایست 
           <br/>
           سوئے قطار می کشم ناقۂ بے زمام را
        </p>
      </div>
       </div>
      
 </div>
 <Outlet/>
    </>
  );
};

export default Introduction;
