import React from "react";
import IntroLinks from "./IntroLinks";
import iqratrust from"../assets/IqraRauzatulAtfal.png"
const Mahadulhafizat = () => {
  return (
    <>
      <div className="intro-container">
        <header className="header">
          <h3 className="heading"><img src={iqratrust} alt="" className="iqratrust" /></h3>
        </header>
        <div className="intro-content">
          {/* <aside className="links-list">
            <IntroLinks />
          </aside> */}
          <div className="intro-detail">
            <h3>اقرأ معہدالحافظات</h3>
            <br />
                   
            <p>
            اقرأمعہد الحافظات  کا قیام:
              آٹھویں کلاس کی تکمیل کے بعد نویں کلاس میں آغاز تعلیم کے ساتھ ہی
              طلبہ کو اپنے مستقبل کی تعلیم کے سلسلہ میں کوئی نہ کوئی گروپ اختیار
              کرنا ہوتا ہے۔ بعض طلبہ سائنس گروپ اختیار کرتے ہیں جب کہ بعض جنرل
              گروپ (آرٹس وکامرس گروپ ) اختیار کرتے ہیں، اقرأحفاظ سیکنڈری اسکول
              نے اب تک سائنس گروپ ہی رکھا تھا تا کہ وہ سائنس کی معیاری تعلیم
              حاصل کریں چنانچہ طلبہ سائنس گروپ کے ذیلی شعبوں کمپیوٹر یا
              بائیولوجی گروپ میں سے کسی ایک کا انتخاب کرتے ہیں۔ بہت سے والدین
              اور طلبہ کی جانب سے اس خواہش کا شدت سے اظہار کیا گیا کہ جس طرح
              اقرأنے روضہ، حفظ اور اسکول کے شعبہ میں عام اسلوب سے ہٹ کر نیا قدم
              اٹھایا، اسی طرح آٹھویں کلاس کے بعد ایک عالمہ گروپ بھی تشکیل دے، اس
              گروپ کے تحت خواہشمند طالبات کو معیاری عالمہ کورس کرایا جائے اور اس
              عالمہ کورس کے ساتھ ان کو جدید علوم بھی پڑھائے جائیں اور ان کو
              اقرأحفاظ اسکول اور کالج کے ذریعہ ریگولر امیدوار کی حیثیت سے میٹرک
              اور انٹر بورڈ کراچی سے میٹرک اور انٹر کے امتحانات بھی دلوائے
              جائیں۔ اقر آ نے اس سلسلہ میں ہر سطح پر مشاورت کی اور آٹھویں کلاس
              سے فارغ ہو کر نویں کلاس میں جانے والی طالبات سے بھی ان کی رائے لی
              اور پھر اللہ پر بھروسہ کرتے ہوئے اس عالمہ گروپ کے لیے اقرأ روضۃ
              الاطفال کے زیر انتظام ایک مستقل شعبہ اسی سال یعنی 2005 ۱۴۲۵ھ کو
              قائم کیا ہے جس کا نام " اقرأ معہد الحافظات (IQRA HAFIZAT ACADEMY)
              تجویز کیا گیا ہے۔ اقرأمعہد الحافظات کی بنیادی خصوصیات: اقرأاپنی ان
              طالبات کے لیے جو آٹھویں جماعت سے فارغ ہونے کے بعد بیک وقت دینی اور
              عصری علوم میں مہارت کی آرزومند ہیں، چار سالہ عالمہ کورس کا آغاز
              کیا ہے جس میں انہیں نہ صرف یہ کہ دینی علوم تفسیر قرآن، حدیث، فقہ،
              عربی زبان، اسلامی تاریخ، اصول تفسیر ، اصول حدیث ، اصول فقہ، بنیادی
              عقائد وغیرہ کا معیاری نصاب پڑھایا جائے گا بلکہ انہیں نویں دسویں،
              گیارہویں اور بارہویں جماعت کا نصاب بھی جنرل اور آرٹس گروپ کے تحت
              پڑھایا جائے گا اوراقرأ حفاظ اسکول اور کالج کے تحت میٹرک بورڈ اور
              انٹر میڈیٹ بورڈ سے با قاعدہ ان کا امتحان بھی دلوایا جائے گا۔
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default Mahadulhafizat;
