import React from "react";
import IntroLinks from "./IntroLinks";
import iqratrust from"../assets/IqraRauzatulAtfal.png"
const Qaidanazra = () => {
  return (
    <>
      <div className="intro-container">
        <header className="header">
          <h3 className="heading"><img src={iqratrust} alt=""  className="iqratrust"/></h3>
        </header>
        <div className="intro-content">
          {/* <aside className="links-list">
            <IntroLinks />
          </aside> */}
          <div className="intro-detail">
            <h3> شعبہ قاعدہ و ناظرہ</h3>
            <br />
            <p>
              اقرأروضتہ الاطفال کا ایک ذیلی شعبہ قاعدہ بھی ہے .برصغیر پاک و ہند
              میں مسلمان بچوں کی تعلیم کا آغاز روایتی طور پر قاعدہ سے ہوا کرتا
              تھا،چاہے وہ بغدادی قاعدہ ہو یا یسرنا القرآن ہو،نورانی قاعدہ ہو یا
              کوئی اور قاعدہ ؛لیکن سب کی بنیاد یہی حروف ہجا ہوا کرتے تھے اور
              مقصد بھی ایک ہی ہوا کرتا تھا کہ بچے کو قرآنی حروف و الفاظ کی شناخت
              بھی ہوجائے،اعراب(حرکات و سکون وغیرہ)کو بھی سمجھ لے اور حروف و
              اعراب کو ملا کر ہجہ کرنے، پھر قرآن رواں پڑھنے کے قابل ہو جائے، اور
              بتدریج قرآن کریم ناظرہ (دیکھ کر)پڑھنے کی صلاحیت حاصل کرلے۔تجوید کے
              مطابق پڑھنا ضروری ہے، لیکن معدودے چند اساتذہ و معلمات کے علاوہ
              اکثریت حافظ جی یا بڑی بی کی شکل میں قاعدہ و ناظرہ پڑھانے والے خود
              بھی تجوید سے نا آشناہی ہوا کرتے تھے۔
              <br /> اللہ تعالی کروڑوں رحمتیں نازل فرمائے نورانی قاعدہ کے مؤلف
              حضرت قاری نور محمد لدھیانوی صاحب اور اس کے حضرت قاری فتح محمد صاحب
              پر جنہوں نے تجوید کی اہمیت کی وجہ سے قاعدہ پر خصوصی توجہ دی اور
              طریقہ تعلیم کے لئے بھی بہترین رہنمائی فرمائی ۔بعد میں بھی بہت سے
              حضرات نے قابل قدر خدمات انجام دیں ۔محشی
              <br />
              اقرأقاعدہ بھی اسی سلسلہ کی ایک کڑی ہے ۔<br /> اب تو الحمدللہ
              قاعدہ کو صحیح انداز سے پڑھانے کے لئے با ضابطہ تربیتی کورس کرائے
              جاتے ہیں اور بھر پور محنت کرائی جاتی ہے۔اقرأ روضتہ الاطفال کے
              ابتدائی ایام میں ایک قاعدہ پڑھایا گیا، لیکن بہت جلد احساس ہوگیا اس
              شعبہ میں بھی تجدید اور اصلاح ضروری ہے، لہذا بڑی توجہ اور محنت سے
              اقرأ قاعدہ مرتب کیا گیا، اصول تدریج کو مدنظر رکھتے ہوئے ''ایک
              تختی میں ایک نئی بات ''کے انداز میں قاعدہ کو تختی نمبر 1، تختی
              نمبر 2،.... کے طرز پر 20 تختیوں پر ترتیب دیاگیا۔ہر ہر حرف، ہرہر
              لفظ، اور ہر ہر تختی میں تجوید کے اصولوں کا لحاظ رکھا گیا ہے۔ یہ
              قاعدہ مسلسل نظر ثانی اور ترمیم و اصلاح کے بعد ایک بہترین نصابی
              کتاب کی صورت میں اقرأ میں رائج ہے اور بہت سے دوسرے تعلیمی ادارے
              بھی اس سے مستفید ہو رہے ہیں۔ <br />
              اقرأ قاعدہ کو مفید بنانے کے لئے با ضابطہ طریقہ تعلیم مرتب کیا
              گیا،قاعدہ کی تدریس کی لئے با ضابطہ تدریسی اوقات اور مدت تعلیم کا
              دورانیہ مقرر کیا گیا، پوری کلاس کو اجتماعی طور پر پڑھانے کے لیے
              اساتذہ و معلمات کو تربیت دی گئی ،اس کی آڈیو کیسٹ بنائی گئیں اور اب
              اساتذہ و معلمات کے لئے تربیتی کورس کے ساتھ ساتھ تجدیدی کورس کا بھی
              اہتمام کیا جاتا ہے۔
              <br />
              مقاصد
              <br />
              <br />
              تدریس قاعدہ کے ذریعے بچوں کو حروف کی شناخت، اعراب و حرکات وغیرہ کی
              پہچان، پھر حروف و اعراب کو ملا کر ہجہ کرنے اور آخر کار رواں پڑھنے
              کی صلاحیت سے آراستہ کیا جاتا ہے،ساتھ ہی تجوید کے مطابق پڑھنے کی
              تربیت دی جاتی ہے، چاہے بچہ ہجہ کرے، چاہے رواں پڑہے، چاہے وقف
              کرے،ہر مرحلہ پر تجوید پر نظر رکھی جاتی ہے۔اس طرح بچہ قرآن کریم
              ناظرہ پڑھنے کے قابل بن جاتا ہے، جوحفظ کے لئے بنیاد کے درجہ
              میںہے؛کیونکہ یہ مشاہدہ ہے کہ جس کاقاعدہ اچھا ہے وہ ناظرہ میں بہتر
              ہوگا اور جو بہتر ناظرہ پڑھ سکے اس کے لئے حفظ آسان ہے۔ <br />
              <br />
              اسلامیات
              <br />
              <br />
              شعبہ قاعدہ و ناظرہ میں تدریس قاعدہ کے ساتھ ساتھ بنیادی عقائدا ور
              معلومات، چھ کلمے،مختلف مسنون دعائیںپڑھائی جاتی ہیں اور روز مرہ کے
              معمولات کے حوالے سے اخلاق وآداب کی بھی تعلیم دی جاتی ہے۔یہ نصاب
              بھی باضابطہ مرتب ہے
              <br />
              
              اور ''اسلامیات'' کے نام سے خوبصورت طباعت میں دستیاب ہے۔
              <br />
              <br />
              اقرأخوشخطی
              <br />
              <br />
              قاعدہ کا نصاب ایک سال کا ہے جس میں قاعدہ کے ساتھ ساتھ اسلامیات اور
              خوشخطی کی بھی تعلیم دی جاتی ہے۔
              <br />
              اقرأ خوشخطی قاعدہ ہی کے حروف و الفاظ پر مشتمل ہے۔اسے اس طرح مرتب
              کیا گیا ہے کہ بچہ جو سبق قاعدہ میں پڑھے،اسی سبق کی تحریری مشق بھی
              کرے؛ اس طرح سبق بھی آسانی سے یاد ہوجاتا ہے، لکھنے اور نقل کی جبلت
              بھی تسکین پاتی ہے، تحریر میں بھی بہتری آتی ہے اور تبدیلی مضمون کی
              وجہ سے بوریت اور یکسانیت سے بچاؤ بھی ہو جاتا ہے۔
              <br />
              شعبہ قاعدہ کا بنیادی مقصد ہی یہ ہے کہ بچوں کو حفظ کرنے کے لئے تیار
              کیا جائے جو اقرأ کا اولین ہدف ہے،گویا مذکورہ بالا نصاب اور ساری
              تگ و دو اسی گوہر مراد کے حصول کے لئے ہے، اللہ تعالی بار آور
              فرمائیں.آمین!
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default Qaidanazra;
