import React from "react";
import IntroLinks from "./IntroLinks";
import iqratrust from"../assets/IqraRauzatulAtfal.png"
const Rauza = () => {
  return (
    <>
      <div className="intro-container">
        <header className="header">
          <h3 className="heading"><img src={iqratrust} alt=""  className="iqratrust"/></h3>
        </header>
        <div className="intro-content">
          {/* <aside className="links-list">
            <IntroLinks />
          </aside> */}
          <div className="intro-detail">
            <h3>شعبہ روضہ </h3>
            <br />
            <h4>:شعبہ روضہ کی اہمیت</h4>
            <p>
              شعبہ روضہ کی اہمیت کا اندازہ اس بات سے لگایا جاسکتا ہے کہ اقرأکا
              مکمل نام اس شعبہ کے حوالہ سےاقرأ روضۃ الاطفال ٹرسٹ ہے، اگر چہ اقرأ
              کے نظم میں شعبہ روضہ کے علاوہ دیگر شعبے بھی ہیں، مثلاََشعبہ قاعدہ
              ،شعبہ حفظ، شعبہ حفاظ اسکول اور شعبہ حفاظ کا لج؛ لیکن یہ تمام شعبے
              اقرأ روضۃ الاطفال کے تحت ہیں۔ جب ہمارا شعبہ حفظ کافی پھیل گیا اور
              شعبہ اسکول بھی شروع ہو گیا تو ایک روز مفتی مزمل حسین صاحب نے مفتی
              محمد جمیل صاحب،مفتی خالد محمود صاحب اور مولانا شبیر احمد خان سے
              عرض کیا کہ اقرأ روضۃ الاطفال کا لفظ تو بہت چھوٹے بچوں کے کسی
              تعلیمی ادارے کا تصور پیش کرتا ہے، اس سے زیادہ اور کچھ نہیں جب کہ
              عملی طور پر ہمارے پاس اب تو شعبہ حفظ بھی ہے اور شعبہ اسکول بھی ،
              اور ان دونوں شعبوں کے طلباء و طالبات عربی اصطلاح کے مطابق اقرأ
              روضۃ الاطفال کے زمرے سے نکل کر بنین و بنات وغیرہ کے زمرے میں آگئے
              ہیں اور اسی طرح ہماری متعدد شاخیں بھی کھل گئیں ہیں لہذا اس ادارے
              کا نام مجموعہ مدارس اقرأ Iqra Group of Schools رکھ کراقرأ روضۃ
              الاطفال’’ اقرأ تحفیظ القرآن ‘‘اقرأ حفاظ اسکول سب مستقل ادارے
              علیحدہ علیحدہ ناموں سے قائم کر دیے جائیں؛ لیکن یہ تجویز منظور نہ
              ہوئی اور اس سلسلہ میں خصوصیت کے ساتھ مفتی جمیل خان شہید کی رائے
              یہی تھی کہ ادارہ کا آغاز اس شعبہ سے ( یعنی روضہ ) سے ہوا ہے، داخلہ
              بھی سب سے پہلے اس شعبہ میں ہوتا ہے، شعبہ روضہ ہمارے لیے ریڑھ کی
              ہڈی کی حیثیت رکھتا ہے، لہذا اقرأ روضۃ الاطفال کے مکمل نام میں جس
              کو باضابطہ ٹرسٹ کے منظور شدہ میمورنڈم ( ٹرسٹ ڈیڈ ) میں درج کیا
              جائے گا ، اس میں لفظ اقرأ روضۃ الاطفال لازمی اجزاء ہوں گے، چنانچہ
              ایسا ہی ہوا اور یہ اداره "اقرأ روضۃ الاطفال ٹرسٹ کے نام سے رجسٹرڈ
              ہوا اور تمام شعبے یعنی قاعدہ ، حفظ ، اسکول اور کالج بشمول خود شعبہ
              روضہ اس کے ذیلی شعبے قرار پائے۔
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default Rauza;
