import React from "react";
import IntroLinks from "./IntroLinks";
import iqratrust from"../assets/IqraRauzatulAtfal.png"

const Secondaryschool = () => {
  return (
    <>
      <div className="intro-container">
        <header className="header">
          <h3 className="heading"><img src={iqratrust} alt="" className="iqratrust" /></h3>
        </header>
        <div className="intro-content">
          {/* <aside className="links-list">
            <IntroLinks />
          </aside> */}
          <div className="intro-detail">
            <h3>اقرأ حفاظ سیکنڈری اسکول</h3>
            <br />
            <p>
              اقرأکے بعض شعبے تو اقرا کے آغاز کے ساتھ ہی قائم ہو گئے تھے، جیسے
              شعبہ روضہ قاعدہ اور شعبہ حفظ جب کہ دوسرے شعبے بعد میں قائم کئے گئے
              جن میں خصوصیت کے ساتھ اقرأحفاظ اسکول ہے۔<br/>
              
               جیسا کہ پہلے ذکر کیا جا
              چکا ہے کہ برصغیر میں تقسیم سے قبل ہی دینی مدارس اور اسکولز / کالجز
              کے نام سے دو متوازی تعلیمی طبقات قائم ہو گئے تھے اور تقسیم کے بعد
              پاکستان میں بجائے اس کے کہ یہ دو متوازی نظام ختم کر کے پاکستان کے
              قیام کے مقاصد کو سامنے رکھ کر اسلامی نظام تعلیم پر مشتمل ایک
              متوازن نظام تعلیم نافذ کیا جاتا مگر افسوس کہ ایسا نہ ہو سکا، بلکہ
              الٹی گنگا بہنے لگی یعنی جو تعلیمی ادارے دینی تعلیم دے رہے تھے
              انہیں متعصب انتہا پسند فنڈامینٹلسٹ اور دہشت گردی کا مجرم ٹھرایا
              گیا اور انہیں اسلام کے بارے میں لچک پیدا نہ کرنے کا طعنہ دیا جاتا
              رہا اور یہ کہا گیا کہ وہ قومی دھارے میں شامل نہیں، باوجود یکہ دینی
              تعلیمی ادارے قیام پاکستان کی بنیادی مقصد پر سختی سے قائم ہیں
              'پاکستان کی قومی زبان اردوان کا ذریعہ تعلیم ہے ان تعلیمی اداروں
              میں نصابی و ہم نصابی سرگرمیاں سب اسلامی سانچے میں ڈھلی ہوئی ہوتی
              ہیں، حد تو یہ ہے کہ ان کا یونیفارم بھی قومی لباس پر مشتمل ہے بس
              اگر کوئی کمی ہے تو وہ یہ کہ ان کے پاس ان مضامین کی تدریس کا رواج
              نہیں کہ جن کو دنیوی علوم کہا جاتا ہے (اگر چہ ان کو دنیوی علوم کہنا
              بھی محل نظر ہے ) جب کہ دوسری جانب پاکستان میں اسکولز اور کالجز کا
              نیٹ ورک ہے جن میں صرف اور صرف دنیوی تعلیم کے مضامین پڑھائے جاتے
              ہیں، البتہ اس ملک کے اسلامی نام کے ساتھ نسبت برقرار رکھنے کے لیے
              لفظ ” اسلامیات اور دینیات“ کے نام سے ایک مضمون پڑھایا جاتا ہے جس
              کے معیار اور اس کی تدریس کے دوران اسکول، کالج اور خصوصاً یو
              نیورسٹی کے غیر اسلامی ماحول کی ترویج، تدریسی مواد اور اس کی عملی
              شکل، تضادات کا منہ بولتا ثبوت ہے۔<br/>
               مذکورہ بالا دونوں تعلیمی نیٹ ورک
              کا جائزہ لیا جائے تو واضح طور پر نظر آتا تھا کہ عوام الناس کی
              اکثریت اسکولز اور کالجز سے منسلک ہے۔ <br/>
              <br/>

              اب اس صورتحال میں ایک نقطہ
              نظر تو یہ ہوسکتا تھا کہ اسکولز اور کالجز کے نیٹ ورک کو اپنی دھن
              میں مگن رہنے دیا جائے اور ان کو وقت کے دھارے کے ساتھ بہنے دیا جائے
              جبکہ دوسرا طریقہ یہ تھا کہ ان کو آواز دی جائے کہ وہ اپنا رخ تبدیل
              کریں اور دینی مدارس کے طبقہ میں شامل ہو کر اپنے آپ کو صرف دینی
              تعلیم کے مضامین تک مخصوص کر دیں، لیکن اب اس آواز کولگانے کا کوئی
              فائدہ نظر نہیں آرہا اس لئے کہ جن تعلیمی اداروں کوحکومت کی سرپرستی
              حاصل ہو اورلفظ تعلیم کا مصداق صرف ان اسکول اور کالجز کی تعلیم کو
              قرار دیا جاتا ہو اور اس نیٹ ورک سے منسلک طلباء و طالبات کا تناسب
              کچھ اس طرح ہو کہ ملک میں زیر تعلیم طلباء و طالبات میں ایک ہزار میں
              سے ۹۹۹ / اسکولز کے نیٹ ورک سے منسلک ہوں تو ایسے میں ان کو اس طرف
              لانا بھی ممکن نہیں تھا اس لیے کہ اب آواز دینے میں بہت تاخیر ہو چکی
              تھی وہ اس سسٹم کے عادی اور اس کا حصہ بن چکے تھے اب ان کی اصلاح
              احوال کی صرف اور صرف ایک ہی صورت سمجھ آتی تھی وہ یہ کہ ان کے اس
              سسٹم اور نظم کے مثبت پہلوؤں کو برقرار رکھتے ہوئے ان کو ایسا نظام
              تعلیم فراہم کیا جائے جس کی بنیادوں میں قرآن اور اسلامی تعلیمات کا
              بیج بویا گیا ہو اس کی سرپرستی علماء دین کے پاس ہو ادارے کا ماحول
              اسلامی فکر وذہنیت کی عکاسی کرتا ہو علمائے حق کے عقائد وافکار کی
              نمائندگی کرتا ہوا اور اسلام کا صحیح فکری اور عملی تصور پیش کرتا ہو
              ا نتہاء پسندی ، فرقہ واریت، تعصب اور کسی قسم کی سیاسی وابستگی سے
              کنارہ کش ہو کر اعتدال پسندی اور اسلامی روشن خیالی (نہ کہ مغربی
              روشن خیالی) اور بہتر معیارتعلیم کا آئینہ دار ہو اس کی نصابی ہم
              نصابی اور غیر نصابی سرگرمیاں جہاں ایک طرف موجودہ وقت کے معیار کے
              مطابق ہوں وہاں وہ مغربی طرز فکر اور کلچر کی ترویج سے اور اس کی
              آمیزش سے پاک ہوں ان تعلیمی اداروں کے طلباء وطالبات اپنی وضع قطع کے
              لحاظ سے دور سے نظر آئیں کہ اسلامی نظام تعلیم سے وابستہ طالب علم
              اور طالبہ ہے طلباء وطالبات میں اسلامی اقدار تشخص کا فروغ دیا جائے                           
              ۔ <br/>مذکورہ بالا بنیادی فکر پر جس تعلیمی ادارے کو قائم کیا گیا وہ اقر
              حفاظ اسکول کی شکل میں نمودار ہوا۔
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default Secondaryschool;
